
    <div class="introduce">
      <h4 class="mb-4">자기소개</h4>
      <h5 class="mb-4">`코딩` 🥰</h5>
      <p>
        내가 원하는 것을 만들어 줄 수 있게 해준 또 하나의 손 같은 존재입니다.
      </p>
      <p>
        컴퓨터를 통해서 무언가를 만들어 낼 때 몇 시간을 앉아서 코딩하고 도전하고
        실패하고 찾아보고 문제를 해결하고 그래도 지루하지 않고 저한테 정말
        적성이 잘 맞고 너무나 재밌었습니다. 이것저것 만져보면서 오류를 해결했을 때
        그 기분은 매우 좋아서 저는 코딩을 계속하고 있는 것 같습니다.
      </p>
      <p>
        예전에 계획은 JavaScript를 좀 더 숙련도 있게 계속해서 FE, BE 모두를 구성할 수 있고 만들어낼 수 있는 개발자로 성장하고 싶다는 계획이었는데 이제 그 목표는 이뤄냈습니다. 정말 JavaScript는 대단한 것 같습니다.
      </p>
      <p>
        이제 꾸준히 갈고 닦아서 퍼포먼스가 좋은 깔끔한 코드를 짜는 것을 목표로 공부하고 코딩하고 성장하고 싶은 사람입니다.
      </p>
      <p>
        제가 코딩을 시작하고 좋아하게 된 계기를 소개해봅니다!
      </p>
      <p>
        저는 95년생입니다. 어리다면 어릴 수 있지만 자신에 대해서 책임을 져야 할 나이라고 생각합니다.<br />
        20살까지는 어느 목표가 없는 평범한 학생이었습니다. 대학교 진학보다는 내가 하고 싶은 것을 먼저 찾고 그것에 대해서 필요하다 느낄 때 하자고 마음을 먹었습니다! 인테리어, 영상, 촬영, 여행 등등…
      </p>
      <p>
        그러다 21살에 입대를 하고 군대에서 많은 것들이 저를 성숙하게 만들어 줬습니다.
      </p>
      <p>
        22살 겨울에 제대를 하고 저는 UIUX디자인(국비훈련)을 받게 되었습니다. 왜? why? 그 당시에 저는 영상, 특수효과, VFX 관심이 많아서 공부를 하면서 정리한 내용을 블로그를 통해 글을 쓰면서 블로그? 웹에 대해서 흥미가 있다가 어떻게 하면 네이버에서만 제공하는 틀이 아닌 자유롭게 구성할 수 있을까? 고민하다 웹 개발 웹디자인에 접하게 되었습니다. 
      </p>
      <p>
        그렇게 국비 훈련을 마치고 구직을 하다가 킨스데이즈라는 기업과 인연이 되어서 직원이 아닌 프리랜서로 작업하는 형식으로 일을 시작하게 되었습니다.
      </p>
    </div>